import GlassCarousel from "./GlassCarousel.js";

const testimonials = [{
        name: "נעה שאואט",
        text: "אני סופר ממליצה על העבודות שלכם! קודם כל העיצובים שלכם ברמה סופר גבוהה ויש לה ייחודיות מטורפת, אני יכולה להיות חסרת ויזן לגמרי ולזרוק לך מילה שניים ואתה ישר תדע איך לקחת את זה לקצה ולעשות מזה יצירת אומנות אז המקצועיות היא ברמה הכי גבוהה שיש וגם השירות ! הכל סופר זריז זמינות שיא הכל נעשה ברוח טובה וברצון ובכיף ואני ממש זכיתי בכם!!!"
    },
    {
        name: "נעה ניר",
        text: "העבודה שלי עם BM STUDIO היא חווית עבודה הכי מקצועית, אכפתית, מסורה, מדהימה וטובה שנתקלתי בה \n" +
            "וזה אחרי עבודה עם המון אנשי מקצוע בתעשייה, הם באמת התעלו מעל הכל. \n" +
            "מדובר קודם כל באנשים מדהימים ורגישים, ומעל להכל - פשוט מקצועיים שאכפת להם באמת מהלקוחות שלהם, \n" +
            "וזה כלכך נדיר למצוא אנשים כאלה היום. \n" +
            "אני יכולה להגיד בלב שלם שהם האנשים שלי לכל פתרון ובעיה. הם תמיד עוזרים, מתעניינים ועובדים ברגישות אמיתית וביחס חם וכלכך כיף. \n" +
            "זאת מתנה לעבוד עם צוות שאני סומכת עליהם במיליון אחוז \n" +
            "ואמשיך לעבוד איתם יד ביד בכל פרוייקט שלי. לא יצא לי עוד לכתוב  המלצה כזאת מהלב, אבל באמת שכלכך מגיע להם. \n" +
            "היו כמה פעמים שהייתי צריכה עזרה מהרגע להרגע, והם מיד נענו לי ועזרו לי בהתנדבות ובלב ענק \n" +
            "רק כדי לעזור בעת צרה ולהיות לצידי, וזה משהו שלא אשכח להם! \n" +
            "אם יש לי המלצה אחת, זה פשוט לשתף איתם פעולה בכל דרך שתבחרו. ❤️"
    },
    {
        name: "טבע דקל",
        text: "מעבר לזה שאברי ואופיר פשוט מוכשרים בטירוף וכל שירות שהם מציעים ללקוח הוא הכי מקצועי שיש, הם נותנים יחס אישי ומותאם בול למה שאני צריכה כל פעם מחדש! יש להם את הסבלנות, את הרגישות ואת היכולת ללוות אותי בתהליך ולהביא את התוצר שהכי מתאים לי. הם הופכים את הרעיון שלי מחלום קטן למציאות! לא הייתי בוחרת באף אחד אחר במקומם🫶"
    },
    {
        name: "ליאב ויצמן",
        text: "קודם כל ממש תודה על הלוגו שמלווה אותי כמעט שנה 🥰\n" +
            "אני מרוצה ממנו בטירוף וזה בול התוספת הקטנה שהייתי צריכה לעסק שלי כדי שייראה יותר רציני, מקצועי ואסתטי \n" +
            "ותודה גם על היחס שנתת לי זה היה לגמריי פתוח לבחירה ועשינו גם קצת שינויים תוך כדי עד שהגענו לתוצר הסופי שהייתי סופר מרוצה ממנו 🫶🏻"
    },
    {
        name: "נבו אזולאי",
        text: "BM Studio- תותחים! \n" +
            "אנשים שיודעים לעשות את העבודה ונותנים 100% מעצמם ללקוח. הם בנו לי לוגו לעסק לפני כמה חודשים והרגשתי שזה בדיוק מה שמתאים לי מבחינת הקונספט, לא מצטער לרגע  שבחרתי בהם!"
    },
    {
        name: "עידו מועלם",
        text: "תודה לצוות BM Studio על ההירתמות מכל הלב במהלך מלחמת \"חרבות ברזל\" לליווי של עיצוב גרפי עבורנו, קהילת ההסברה IronBridge. תודה מיוחדת לאברי על קרייאטיב לתוך השעות הקטנות של הלילה ועזרה בכל מה שצריך על מנת לבצע הסברה איכותית"
    },
    {
        name: "ערן ניר",
        text: "המשרד עיצב עבורי כרזה בשיא המהירות והכישרון לשביעות רצוני המלאה תוך שירות ומענה מהיר ממליץ בחום"
    },
    {
        name: "עמית מידן",
        text: "בעבודה איתכם ממש הרגשתי שהדעה שלי הכי חשובה ושהכי חשוב שאני אהיה מרוצה, זה היה ממש משמעותי בשבילי כי זה פרויקט שממש קרוב לליבי אז כל דבר קטן הרגיש כמו משהו גדול וזה היה כל כך נעים להרגיש שיש הקשבה ואכפתיות ורצון אמיתי שזה יהיה מושלם❤️ תודה"
    }
];

const carousel = new GlassCarousel({

    container: "#testimonialCarousel",

    data: testimonials,

    autoPlay: true,

    interval: 5000,

    render(item) {

        return `
            <div class="testimonial">

                <p>${item.text}</p>

                <h3>${item.name}</h3>

            </div>
        `;

    }

});


window.addEventListener("keydown", e => {

    if (e.key === "ArrowRight") {

        carousel.previous();

    }

    if (e.key === "ArrowLeft") {

        carousel.next();

    }

});